;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

(package! deadgrep)
(package! org-clock-convenience)
(package! anki-editor
  :recipe (:host github :repo "anki-editor/anki-editor"))
(package! org-auto-tangle)
(package! dired-open)
(package! dired-subtree)
(package! peep-dired)
(package! emojify)
(package! csv-mode)
(package! dashboard)
(package! org-modern
  :recipe (:host github :repo "minad/org-modern"))
;;(package! copilot
;;  :recipe (:host github :repo "copilot-emacs/copilot.el" :files ("*.el")))
(package! modus-themes)
(package! leetcode)
(package! org-super-agenda)
(package! wakatime-mode)
(package! fcitx)
